# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\Hackster Projects\Infenion Microcontroller\Infineon-CY8CKIT-041-41XX_Example_Projects-Software-v01_00-EN\PSoC 4100S\CE216892 USB-HID Trackpad\CE216892 USB-HID Trackpad.cydsn\CE216892 USB-HID Trackpad.cyprj
# Date: Wed, 15 Feb 2023 05:02:45 GMT
#set_units -time ns
create_clock -name {CapSense_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {EZI2C_SCBCLK(FFB)} -period 583.33333333333326 -waveform {0 291.666666666667} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {EZI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 27} -nominal_period 583.33333333333326 [list]


# Component constraints for E:\Hackster Projects\Infenion Microcontroller\Infineon-CY8CKIT-041-41XX_Example_Projects-Software-v01_00-EN\PSoC 4100S\CE216892 USB-HID Trackpad\CE216892 USB-HID Trackpad.cydsn\TopDesign\TopDesign.cysch
# Project: E:\Hackster Projects\Infenion Microcontroller\Infineon-CY8CKIT-041-41XX_Example_Projects-Software-v01_00-EN\PSoC 4100S\CE216892 USB-HID Trackpad\CE216892 USB-HID Trackpad.cydsn\CE216892 USB-HID Trackpad.cyprj
# Date: Wed, 15 Feb 2023 05:02:44 GMT
